src/VirtualClient/TestResources/Results_MemcachedMemtier.txt
4         Threads
1         Connections per thread
60        Seconds


ALL STATS
============================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p90 Latency     p95 Latency     p99 Latency   p99.9 Latency       KB/sec
------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets         4827.17          ---          ---         2.64323         2.83100         3.93500         4.47900         7.45500        29.56700       329.45
Gets        43444.12     43444.12         0.00         2.61979         2.73500         3.88700         4.41500         7.42300        29.31100      3724.01
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---          ---
Totals      48271.29     43444.12         0.00         2.62213         2.75100         3.90300         4.41500         7.42300        29.31100      4053.46


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.071        0.000
SET       0.359        5.000
SET       0.503       10.000
SET       0.823       15.000
SET       1.231       20.000
SET       1.623       25.000
SET       1.967       30.000
SET       2.239       35.000
SET       2.463       40.000
SET       2.671       45.000
SET       2.831       50.000
SET       2.895       52.500
SET       2.959       55.000
SET       3.007       57.500
SET       3.055       60.000
SET       3.087       62.500
SET       3.135       65.000
SET       3.183       67.500
SET       3.215       70.000
SET       3.279       72.500
SET       3.343       75.000
SET       3.375       76.250
SET       3.407       77.500
SET       3.455       78.750
SET       3.503       80.000
SET       3.551       81.250
SET       3.599       82.500
SET       3.647       83.750
SET       3.695       85.000
SET       3.743       86.250
SET       3.807       87.500
SET       3.839       88.125
SET       3.871       88.750
SET       3.903       89.375
SET       3.935       90.000
SET       3.967       90.625
SET       4.015       91.250
SET       4.079       91.875
SET       4.127       92.500
SET       4.191       93.125
SET       4.287       93.750
SET       4.319       94.062
SET       4.351       94.375
SET       4.415       94.688
SET       4.479       95.000
SET       4.543       95.312
SET       4.607       95.625
SET       4.703       95.938
SET       4.799       96.250
SET       4.927       96.562
SET       5.087       96.875
SET       5.183       97.031
SET       5.279       97.188
SET       5.407       97.344
SET       5.535       97.500
SET       5.663       97.656
SET       5.823       97.812
SET       5.983       97.969
SET       6.143       98.125
SET       6.303       98.281
SET       6.527       98.438
SET       6.623       98.516
SET       6.751       98.594
SET       6.847       98.672
SET       7.007       98.750
SET       7.103       98.828
SET       7.263       98.906
SET       7.423       98.984
SET       7.615       99.062
SET       7.775       99.141
SET       7.999       99.219
SET       8.127       99.258
SET       8.255       99.297
SET       8.383       99.336
SET       8.575       99.375
SET       8.703       99.414
SET       8.959       99.453
SET       9.215       99.492
SET       9.471       99.531
SET       9.855       99.570
SET      10.431       99.609
SET      10.815       99.629
SET      11.455       99.648
SET      12.287       99.668
SET      12.991       99.688
SET      14.079       99.707
SET      15.231       99.727
SET      15.935       99.746
SET      16.767       99.766
SET      17.791       99.785
SET      19.199       99.805
SET      19.711       99.814
SET      20.479       99.824
SET      21.503       99.834
SET      22.143       99.844
SET      23.551       99.854
SET      24.703       99.863
SET      26.367       99.873
SET      27.903       99.883
SET      28.543       99.893
SET      30.079       99.902
SET      30.463       99.907
SET      30.591       99.912
SET      30.975       99.917
SET      31.615       99.922
SET      32.255       99.927
SET      32.767       99.932
SET      33.279       99.937
SET      33.279       99.941
SET      34.047       99.946
SET      34.815       99.951
SET      35.071       99.954
SET      35.839       99.956
SET      36.351       99.958
SET      38.399       99.961
SET      38.911       99.963
SET      39.167       99.966
SET      40.959       99.968
SET      42.751       99.971
SET      43.007       99.973
SET      43.519       99.976
SET      43.775       99.977
SET      44.031       99.978
SET      44.287       99.979
SET      45.055       99.980
SET      45.311       99.982
SET      45.567       99.983
SET      46.335       99.984
SET      47.103       99.985
SET      47.103       99.987
SET      47.359       99.988
SET      49.663       99.988
SET      50.175       99.989
SET      50.687       99.990
SET      51.455       99.990
SET      51.967       99.991
SET      51.967       99.991
SET      51.967       99.992
SET      52.479       99.993
SET      52.479       99.993
SET      53.247       99.994
SET      53.247       99.994
SET      53.503       99.995
SET      53.503       99.995
SET      53.503       99.995
[...]
SET      54.783       99.996
SET      55.039       99.996
SET      55.039       99.996
SET      56.319       99.997
SET      56.319       99.997
SET      56.319       99.997
[...]
SET      56.319       99.998
SET      57.855       99.998
SET      57.855       99.998
SET      58.367       99.998
SET      58.367       99.998
SET      59.135       99.998
SET      59.135       99.998
SET      59.135       99.999
SET      61.439       99.999
SET      61.439       99.999
SET      61.439       99.999
[...]
SET      73.215       99.999
SET      73.215      100.000
---
GET       0.055        0.000
GET       0.391        5.000
GET       0.655       10.000
GET       0.967       15.000
GET       1.311       20.000
GET       1.623       25.000
GET       1.927       30.000
GET       2.175       35.000
GET       2.383       40.000
GET       2.575       45.000
GET       2.735       50.000
GET       2.815       52.500
GET       2.879       55.000
GET       2.943       57.500
GET       3.007       60.000
GET       3.055       62.500
GET       3.103       65.000
GET       3.135       67.500
GET       3.183       70.000
GET       3.231       72.500
GET       3.295       75.000
GET       3.327       76.250
GET       3.359       77.500
GET       3.407       78.750
GET       3.455       80.000
GET       3.503       81.250
GET       3.551       82.500
GET       3.599       83.750
GET       3.647       85.000
GET       3.711       86.250
GET       3.759       87.500
GET       3.791       88.125
GET       3.823       88.750
GET       3.855       89.375
GET       3.887       90.000
GET       3.935       90.625
GET       3.967       91.250
GET       4.015       91.875
GET       4.079       92.500
GET       4.159       93.125
GET       4.223       93.750
GET       4.255       94.062
GET       4.319       94.375
GET       4.351       94.688
GET       4.415       95.000
GET       4.479       95.312
GET       4.543       95.625
GET       4.639       95.938
GET       4.735       96.250
GET       4.863       96.562
GET       5.023       96.875
GET       5.087       97.031
GET       5.183       97.188
GET       5.311       97.344
GET       5.439       97.500
GET       5.599       97.656
GET       5.727       97.812
GET       5.887       97.969
GET       6.047       98.125
GET       6.239       98.281
GET       6.463       98.438
GET       6.559       98.516
GET       6.687       98.594
GET       6.783       98.672
GET       6.911       98.750
GET       7.039       98.828
GET       7.199       98.906
GET       7.359       98.984
GET       7.519       99.062
GET       7.711       99.141
GET       7.935       99.219
GET       8.063       99.258
GET       8.191       99.297
GET       8.319       99.336
GET       8.511       99.375
GET       8.703       99.414
GET       8.895       99.453
GET       9.151       99.492
GET       9.407       99.531
GET       9.791       99.570
GET      10.367       99.609
GET      10.687       99.629
GET      11.327       99.648
GET      12.223       99.668
GET      12.863       99.688
GET      14.015       99.707
GET      15.103       99.727
GET      15.807       99.746
GET      16.767       99.766
GET      17.791       99.785
GET      18.943       99.805
GET      19.583       99.814
GET      20.223       99.824
GET      20.991       99.834
GET      21.887       99.844
GET      22.783       99.854
GET      24.447       99.863
GET      25.855       99.873
GET      27.519       99.883
GET      28.415       99.893
GET      29.567       99.902
GET      30.207       99.907
GET      30.591       99.912
GET      30.975       99.917
GET      31.487       99.922
GET      31.999       99.927
GET      32.383       99.932
GET      33.279       99.937
GET      33.279       99.941
GET      34.047       99.946
GET      34.815       99.951
GET      35.071       99.954
GET      36.095       99.956
GET      36.607       99.958
GET      38.655       99.961
GET      38.911       99.963
GET      39.167       99.966
GET      40.959       99.968
GET      42.495       99.971
GET      42.751       99.973
GET      43.775       99.976
GET      43.775       99.977
GET      44.287       99.978
GET      44.543       99.979
GET      44.543       99.980
GET      45.311       99.982
GET      45.567       99.983
GET      46.335       99.984
GET      46.847       99.985
GET      47.103       99.987
GET      47.871       99.988
GET      49.151       99.988
GET      50.431       99.989
GET      51.455       99.990
GET      51.711       99.990
GET      51.967       99.991
GET      51.967       99.991
GET      51.967       99.992
GET      52.479       99.993
GET      52.479       99.993
GET      53.247       99.994
GET      53.247       99.994
GET      53.503       99.995
GET      53.503       99.995
GET      53.503       99.995
[...]
GET      54.783       99.996
GET      54.783       99.996
GET      55.039       99.996
GET      55.039       99.997
GET      56.319       99.997
GET      56.319       99.997
GET      56.319       99.997
[...]
GET      56.319       99.998
GET      56.319       99.998
GET      57.855       99.998
GET      58.111       99.998
GET      58.367       99.998
GET      58.367       99.998
GET      59.135       99.998
GET      59.903       99.999
GET      60.415       99.999
GET      60.927       99.999
GET      61.439       99.999
GET      61.439       99.999
GET      73.215       99.999
GET      73.215      100.000
---
WAIT      0.000      100.000
4         Threads
1         Connections per thread
60        Seconds


ALL STATS
============================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p90 Latency     p95 Latency     p99 Latency   p99.9 Latency       KB/sec
------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets         4791.00          ---          ---         2.67920         2.83100         3.95100         4.51100         8.38300        35.83900       326.98
Gets        43118.78     43118.78         0.00         2.64020         2.75100         3.90300         4.44700         7.96700        34.81500      3696.12
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---          ---
Totals      47909.78     43118.78         0.00         2.64410         2.75100         3.91900         4.44700         7.99900        35.07100      4023.11


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.063        0.000
SET       0.359        5.000
SET       0.511       10.000
SET       0.775       15.000
SET       1.127       20.000
SET       1.519       25.000
SET       1.887       30.000
SET       2.207       35.000
SET       2.447       40.000
SET       2.655       45.000
SET       2.831       50.000
SET       2.895       52.500
SET       2.959       55.000
SET       3.007       57.500
SET       3.055       60.000
SET       3.103       62.500
SET       3.135       65.000
SET       3.183       67.500
SET       3.231       70.000
SET       3.279       72.500
SET       3.343       75.000
SET       3.375       76.250
SET       3.423       77.500
SET       3.471       78.750
SET       3.519       80.000
SET       3.551       81.250
SET       3.615       82.500
SET       3.663       83.750
SET       3.711       85.000
SET       3.759       86.250
SET       3.823       87.500
SET       3.839       88.125
SET       3.871       88.750
SET       3.919       89.375
SET       3.951       90.000
SET       3.999       90.625
SET       4.047       91.250
SET       4.095       91.875
SET       4.159       92.500
SET       4.223       93.125
SET       4.319       93.750
SET       4.351       94.062
SET       4.383       94.375
SET       4.447       94.688
SET       4.511       95.000
SET       4.575       95.312
SET       4.639       95.625
SET       4.735       95.938
SET       4.831       96.250
SET       4.991       96.562
SET       5.151       96.875
SET       5.247       97.031
SET       5.375       97.188
SET       5.503       97.344
SET       5.663       97.500
SET       5.823       97.656
SET       5.983       97.812
SET       6.207       97.969
SET       6.431       98.125
SET       6.655       98.281
SET       6.911       98.438
SET       7.039       98.516
SET       7.199       98.594
SET       7.359       98.672
SET       7.583       98.750
SET       7.743       98.828
SET       7.999       98.906
SET       8.319       98.984
SET       8.639       99.062
SET       9.023       99.141
SET       9.471       99.219
SET       9.727       99.258
SET       9.983       99.297
SET      10.303       99.336
SET      10.815       99.375
SET      11.647       99.414
SET      12.607       99.453
SET      13.631       99.492
SET      15.039       99.531
SET      16.255       99.570
SET      17.919       99.609
SET      18.687       99.629
SET      19.327       99.648
SET      19.967       99.668
SET      20.991       99.688
SET      21.887       99.707
SET      23.039       99.727
SET      24.447       99.746
SET      25.855       99.766
SET      27.263       99.785
SET      28.671       99.805
SET      29.055       99.814
SET      29.439       99.824
SET      30.207       99.834
SET      30.847       99.844
SET      31.359       99.854
SET      31.999       99.863
SET      33.535       99.873
SET      34.559       99.883
SET      35.583       99.893
SET      36.095       99.902
SET      36.607       99.907
SET      37.119       99.912
SET      37.631       99.917
SET      38.399       99.922
SET      38.911       99.927
SET      39.423       99.932
SET      39.935       99.937
SET      40.959       99.941
SET      41.471       99.946
SET      42.239       99.951
SET      42.495       99.954
SET      42.751       99.956
SET      43.519       99.958
SET      44.543       99.961
SET      44.799       99.963
SET      45.055       99.966
SET      45.311       99.968
SET      45.823       99.971
SET      46.847       99.973
SET      47.615       99.976
SET      47.871       99.977
SET      47.871       99.978
SET      48.383       99.979
SET      48.639       99.980
SET      48.895       99.982
SET      48.895       99.983
SET      49.919       99.984
SET      50.431       99.985
SET      51.455       99.987
SET      51.967       99.988
SET      53.503       99.988
SET      53.759       99.989
SET      53.759       99.990
SET      54.527       99.990
SET      54.783       99.991
SET      55.039       99.991
SET      56.319       99.992
SET      56.319       99.993
SET      58.623       99.993
SET      58.623       99.994
SET      59.647       99.994
SET      59.903       99.995
SET      60.671       99.995
SET      60.671       99.995
SET      60.671       99.995
SET      60.671       99.996
SET      60.671       99.996
SET      62.207       99.996
SET      62.207       99.997
SET      62.207       99.997
SET      62.207       99.997
SET      62.463       99.997
SET      62.463       99.997
SET      62.463       99.998
SET      70.143       99.998
SET      70.143       99.998
SET      70.143       99.998
[...]
SET      70.143       99.999
SET      70.143       99.999
SET      70.143       99.999
[...]
SET      73.727       99.999
SET      73.727       99.999
SET      73.727       99.999
[...]
SET      74.239       99.999
SET      74.239      100.000
---
GET       0.063        0.000
GET       0.367        5.000
GET       0.607       10.000
GET       0.879       15.000
GET       1.191       20.000
GET       1.527       25.000
GET       1.855       30.000
GET       2.143       35.000
GET       2.367       40.000
GET       2.575       45.000
GET       2.751       50.000
GET       2.831       52.500
GET       2.895       55.000
GET       2.959       57.500
GET       3.007       60.000
GET       3.055       62.500
GET       3.103       65.000
GET       3.151       67.500
GET       3.199       70.000
GET       3.247       72.500
GET       3.311       75.000
GET       3.327       76.250
GET       3.375       77.500
GET       3.423       78.750
GET       3.455       80.000
GET       3.519       81.250
GET       3.567       82.500
GET       3.615       83.750
GET       3.663       85.000
GET       3.727       86.250
GET       3.775       87.500
GET       3.807       88.125
GET       3.839       88.750
GET       3.871       89.375
GET       3.903       90.000
GET       3.951       90.625
GET       3.999       91.250
GET       4.047       91.875
GET       4.127       92.500
GET       4.191       93.125
GET       4.255       93.750
GET       4.287       94.062
GET       4.351       94.375
GET       4.383       94.688
GET       4.447       95.000
GET       4.479       95.312
GET       4.575       95.625
GET       4.639       95.938
GET       4.735       96.250
GET       4.863       96.562
GET       5.023       96.875
GET       5.119       97.031
GET       5.215       97.188
GET       5.343       97.344
GET       5.471       97.500
GET       5.631       97.656
GET       5.823       97.812
GET       6.015       97.969
GET       6.207       98.125
GET       6.463       98.281
GET       6.687       98.438
GET       6.847       98.516
GET       6.975       98.594
GET       7.103       98.672
GET       7.295       98.750
GET       7.519       98.828
GET       7.679       98.906
GET       7.935       98.984
GET       8.255       99.062
GET       8.639       99.141
GET       8.959       99.219
GET       9.215       99.258
GET       9.407       99.297
GET       9.727       99.336
GET       9.919       99.375
GET      10.367       99.414
GET      10.943       99.453
GET      11.839       99.492
GET      13.055       99.531
GET      14.335       99.570
GET      15.679       99.609
GET      16.511       99.629
GET      17.407       99.648
GET      18.431       99.668
GET      19.327       99.688
GET      19.967       99.707
GET      21.119       99.727
GET      22.271       99.746
GET      23.679       99.766
GET      25.215       99.785
GET      26.879       99.805
GET      27.775       99.814
GET      28.543       99.824
GET      29.055       99.834
GET      29.311       99.844
GET      30.207       99.854
GET      30.847       99.863
GET      31.487       99.873
GET      32.639       99.883
GET      33.791       99.893
GET      35.327       99.902
GET      35.583       99.907
GET      35.839       99.912
GET      36.351       99.917
GET      36.863       99.922
GET      37.375       99.927
GET      38.143       99.932
GET      38.911       99.937
GET      39.679       99.941
GET      40.447       99.946
GET      41.215       99.951
GET      41.727       99.954
GET      41.983       99.956
GET      42.495       99.958
GET      42.751       99.961
GET      43.519       99.963
GET      44.543       99.966
GET      44.543       99.968
GET      45.055       99.971
GET      45.823       99.973
GET      46.335       99.976
GET      46.847       99.977
GET      46.847       99.978
GET      47.615       99.979
GET      47.871       99.980
GET      47.871       99.982
GET      48.639       99.983
GET      48.895       99.984
GET      49.151       99.985
GET      49.919       99.987
GET      51.455       99.988
GET      51.455       99.988
GET      53.503       99.989
GET      53.759       99.990
GET      53.759       99.990
GET      54.783       99.991
GET      54.783       99.991
GET      55.039       99.992
GET      55.039       99.993
GET      56.319       99.993
GET      58.623       99.994
GET      58.623       99.994
GET      58.623       99.995
GET      58.623       99.995
GET      59.903       99.995
GET      60.671       99.995
GET      60.671       99.996
GET      60.671       99.996
GET      60.671       99.996
GET      62.207       99.997
GET      62.207       99.997
GET      62.207       99.997
[...]
GET      62.463       99.998
GET      62.719       99.998
GET      70.143       99.998
GET      70.143       99.998
GET      70.143       99.998
[...]
GET      70.143       99.999
GET      70.143       99.999
GET      70.143       99.999
[...]
GET      73.727       99.999
GET      73.727       99.999
GET      73.727       99.999
GET      74.239       99.999
GET      74.239      100.000
---
WAIT      0.000      100.000
4         Threads
1         Connections per thread
60        Seconds


ALL STATS
============================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p90 Latency     p95 Latency     p99 Latency   p99.9 Latency       KB/sec
------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets         4706.32          ---          ---         2.70510         2.86300         4.06300         4.57500         7.35900        24.83100       321.21
Gets        42356.45     42356.45         0.00         2.68904         2.81500         4.03100         4.54300         7.32700        24.70300      3630.78
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---          ---
Totals      47062.77     42356.45         0.00         2.69065         2.81500         4.04700         4.54300         7.32700        24.70300      3951.99


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.063        0.000
SET       0.407        5.000
SET       0.623       10.000
SET       0.951       15.000
SET       1.351       20.000
SET       1.711       25.000
SET       2.031       30.000
SET       2.287       35.000
SET       2.511       40.000
SET       2.703       45.000
SET       2.863       50.000
SET       2.943       52.500
SET       3.007       55.000
SET       3.071       57.500
SET       3.119       60.000
SET       3.167       62.500
SET       3.199       65.000
SET       3.247       67.500
SET       3.311       70.000
SET       3.375       72.500
SET       3.439       75.000
SET       3.487       76.250
SET       3.519       77.500
SET       3.567       78.750
SET       3.615       80.000
SET       3.663       81.250
SET       3.695       82.500
SET       3.743       83.750
SET       3.807       85.000
SET       3.855       86.250
SET       3.919       87.500
SET       3.951       88.125
SET       3.983       88.750
SET       4.015       89.375
SET       4.063       90.000
SET       4.127       90.625
SET       4.159       91.250
SET       4.223       91.875
SET       4.287       92.500
SET       4.351       93.125
SET       4.415       93.750
SET       4.447       94.062
SET       4.479       94.375
SET       4.543       94.688
SET       4.575       95.000
SET       4.639       95.312
SET       4.703       95.625
SET       4.799       95.938
SET       4.863       96.250
SET       4.959       96.562
SET       5.087       96.875
SET       5.183       97.031
SET       5.247       97.188
SET       5.343       97.344
SET       5.439       97.500
SET       5.567       97.656
SET       5.727       97.812
SET       5.855       97.969
SET       6.015       98.125
SET       6.207       98.281
SET       6.431       98.438
SET       6.527       98.516
SET       6.655       98.594
SET       6.751       98.672
SET       6.879       98.750
SET       7.039       98.828
SET       7.167       98.906
SET       7.327       98.984
SET       7.487       99.062
SET       7.679       99.141
SET       7.871       99.219
SET       7.999       99.258
SET       8.127       99.297
SET       8.255       99.336
SET       8.511       99.375
SET       8.639       99.414
SET       8.831       99.453
SET       9.023       99.492
SET       9.279       99.531
SET       9.535       99.570
SET       9.919       99.609
SET      10.047       99.629
SET      10.303       99.648
SET      10.559       99.668
SET      10.879       99.688
SET      11.455       99.707
SET      11.903       99.727
SET      12.735       99.746
SET      13.503       99.766
SET      14.783       99.785
SET      15.871       99.805
SET      16.511       99.814
SET      17.407       99.824
SET      18.175       99.834
SET      18.687       99.844
SET      19.711       99.854
SET      20.991       99.863
SET      21.887       99.873
SET      23.295       99.883
SET      24.319       99.893
SET      25.215       99.902
SET      25.727       99.907
SET      26.239       99.912
SET      26.751       99.917
SET      27.775       99.922
SET      28.415       99.927
SET      29.183       99.932
SET      29.695       99.937
SET      30.463       99.941
SET      30.975       99.946
SET      31.871       99.951
SET      32.255       99.954
SET      33.023       99.956
SET      33.535       99.958
SET      33.535       99.961
SET      34.047       99.963
SET      34.559       99.966
SET      35.327       99.968
SET      36.095       99.971
SET      37.631       99.973
SET      39.167       99.976
SET      39.423       99.977
SET      40.959       99.978
SET      41.215       99.979
SET      41.983       99.980
SET      43.263       99.982
SET      43.519       99.983
SET      46.079       99.984
SET      46.335       99.985
SET      46.847       99.987
SET      48.383       99.988
SET      48.639       99.988
SET      48.895       99.989
SET      49.151       99.990
SET      49.663       99.990
SET      49.663       99.991
SET      49.663       99.991
SET      50.175       99.992
SET      50.431       99.993
SET      51.711       99.993
SET      51.711       99.994
SET      51.711       99.994
SET      52.223       99.995
SET      52.223       99.995
SET      52.223       99.995
[...]
SET      52.223       99.996
SET      52.223       99.996
SET      52.479       99.996
SET      52.479       99.997
SET      52.479       99.997
SET      52.479       99.997
[...]
SET      55.039       99.998
SET      55.039       99.998
SET      55.039       99.998
[...]
SET      55.295       99.998
SET      55.295       99.998
SET      55.295       99.999
SET      60.159       99.999
SET      60.159      100.000
---
GET       0.063        0.000
GET       0.431        5.000
GET       0.703       10.000
GET       1.015       15.000
GET       1.375       20.000
GET       1.695       25.000
GET       1.999       30.000
GET       2.255       35.000
GET       2.463       40.000
GET       2.639       45.000
GET       2.815       50.000
GET       2.895       52.500
GET       2.975       55.000
GET       3.023       57.500
GET       3.087       60.000
GET       3.135       62.500
GET       3.183       65.000
GET       3.231       67.500
GET       3.279       70.000
GET       3.343       72.500
GET       3.407       75.000
GET       3.455       76.250
GET       3.487       77.500
GET       3.535       78.750
GET       3.583       80.000
GET       3.631       81.250
GET       3.679       82.500
GET       3.727       83.750
GET       3.775       85.000
GET       3.823       86.250
GET       3.887       87.500
GET       3.919       88.125
GET       3.951       88.750
GET       3.999       89.375
GET       4.031       90.000
GET       4.079       90.625
GET       4.127       91.250
GET       4.191       91.875
GET       4.255       92.500
GET       4.319       93.125
GET       4.383       93.750
GET       4.415       94.062
GET       4.447       94.375
GET       4.511       94.688
GET       4.543       95.000
GET       4.607       95.312
GET       4.671       95.625
GET       4.767       95.938
GET       4.831       96.250
GET       4.927       96.562
GET       5.055       96.875
GET       5.151       97.031
GET       5.215       97.188
GET       5.311       97.344
GET       5.407       97.500
GET       5.535       97.656
GET       5.695       97.812
GET       5.823       97.969
GET       5.983       98.125
GET       6.175       98.281
GET       6.367       98.438
GET       6.495       98.516
GET       6.623       98.594
GET       6.719       98.672
GET       6.847       98.750
GET       7.007       98.828
GET       7.135       98.906
GET       7.295       98.984
GET       7.455       99.062
GET       7.615       99.141
GET       7.839       99.219
GET       7.967       99.258
GET       8.095       99.297
GET       8.255       99.336
GET       8.447       99.375
GET       8.639       99.414
GET       8.831       99.453
GET       9.023       99.492
GET       9.279       99.531
GET       9.535       99.570
GET       9.855       99.609
GET      10.047       99.629
GET      10.239       99.648
GET      10.495       99.668
GET      10.879       99.688
GET      11.391       99.707
GET      11.839       99.727
GET      12.671       99.746
GET      13.375       99.766
GET      14.399       99.785
GET      15.679       99.805
GET      16.511       99.814
GET      17.151       99.824
GET      18.047       99.834
GET      18.687       99.844
GET      19.711       99.854
GET      20.863       99.863
GET      21.631       99.873
GET      23.039       99.883
GET      24.191       99.893
GET      24.831       99.902
GET      25.471       99.907
GET      26.239       99.912
GET      26.751       99.917
GET      27.647       99.922
GET      28.415       99.927
GET      29.183       99.932
GET      29.695       99.937
GET      30.335       99.941
GET      30.975       99.946
GET      31.743       99.951
GET      32.127       99.954
GET      33.023       99.956
GET      33.279       99.958
GET      33.791       99.961
GET      34.047       99.963
GET      34.303       99.966
GET      34.815       99.968
GET      35.839       99.971
GET      37.375       99.973
GET      39.167       99.976
GET      39.167       99.977
GET      40.703       99.978
GET      41.215       99.979
GET      41.215       99.980
GET      42.239       99.982
GET      43.263       99.983
GET      45.311       99.984
GET      46.079       99.985
GET      46.847       99.987
GET      47.871       99.988
GET      48.383       99.988
GET      48.383       99.989
GET      49.151       99.990
GET      49.151       99.990
GET      49.663       99.991
GET      49.663       99.991
GET      50.175       99.992
GET      50.431       99.993
GET      50.943       99.993
GET      51.711       99.994
GET      51.711       99.994
GET      51.711       99.995
GET      51.967       99.995
GET      52.223       99.995
GET      52.223       99.995
GET      52.223       99.996
GET      52.223       99.996
GET      52.223       99.996
GET      52.479       99.997
GET      52.479       99.997
GET      52.479       99.997
[...]
GET      52.479       99.998
GET      52.479       99.998
GET      55.039       99.998
GET      55.039       99.998
GET      55.039       99.998
[...]
GET      55.039       99.999
GET      55.295       99.999
GET      55.295       99.999
GET      55.295       99.999
[...]
GET      60.159       99.999
GET      60.159      100.000
---
WAIT      0.000      100.000
4         Threads
1         Connections per thread
60        Seconds


ALL STATS
============================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p90 Latency     p95 Latency     p99 Latency   p99.9 Latency       KB/sec
------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets         4892.38          ---          ---         2.60820         2.79900         3.88700         4.41500         7.00700        28.15900       333.90
Gets        44031.14     44031.14         0.00         2.58644         2.73500         3.85500         4.35100         6.94300        28.03100      3774.33
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---          ---
Totals      48923.52     44031.14         0.00         2.58862         2.73500         3.85500         4.35100         6.94300        28.03100      4108.23


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.063        0.000
SET       0.367        5.000
SET       0.551       10.000
SET       0.855       15.000
SET       1.231       20.000
SET       1.607       25.000
SET       1.943       30.000
SET       2.223       35.000
SET       2.447       40.000
SET       2.639       45.000
SET       2.799       50.000
SET       2.863       52.500
SET       2.927       55.000
SET       2.991       57.500
SET       3.039       60.000
SET       3.087       62.500
SET       3.119       65.000
SET       3.167       67.500
SET       3.199       70.000
SET       3.247       72.500
SET       3.311       75.000
SET       3.343       76.250
SET       3.375       77.500
SET       3.423       78.750
SET       3.471       80.000
SET       3.519       81.250
SET       3.567       82.500
SET       3.615       83.750
SET       3.663       85.000
SET       3.727       86.250
SET       3.775       87.500
SET       3.791       88.125
SET       3.823       88.750
SET       3.855       89.375
SET       3.887       90.000
SET       3.935       90.625
SET       3.967       91.250
SET       4.015       91.875
SET       4.079       92.500
SET       4.159       93.125
SET       4.223       93.750
SET       4.255       94.062
SET       4.319       94.375
SET       4.351       94.688
SET       4.415       95.000
SET       4.447       95.312
SET       4.543       95.625
SET       4.607       95.938
SET       4.703       96.250
SET       4.799       96.562
SET       4.927       96.875
SET       5.023       97.031
SET       5.119       97.188
SET       5.183       97.344
SET       5.311       97.500
SET       5.407       97.656
SET       5.567       97.812
SET       5.695       97.969
SET       5.823       98.125
SET       5.983       98.281
SET       6.175       98.438
SET       6.271       98.516
SET       6.399       98.594
SET       6.495       98.672
SET       6.591       98.750
SET       6.719       98.828
SET       6.847       98.906
SET       6.975       98.984
SET       7.167       99.062
SET       7.327       99.141
SET       7.519       99.219
SET       7.647       99.258
SET       7.743       99.297
SET       7.903       99.336
SET       8.031       99.375
SET       8.191       99.414
SET       8.383       99.453
SET       8.575       99.492
SET       8.831       99.531
SET       9.151       99.570
SET       9.407       99.609
SET       9.663       99.629
SET       9.919       99.648
SET      10.175       99.668
SET      10.559       99.688
SET      10.815       99.707
SET      11.391       99.727
SET      12.031       99.746
SET      12.799       99.766
SET      13.823       99.785
SET      15.871       99.805
SET      16.895       99.814
SET      18.303       99.824
SET      20.351       99.834
SET      22.143       99.844
SET      23.551       99.854
SET      25.087       99.863
SET      25.983       99.873
SET      27.007       99.883
SET      27.647       99.893
SET      28.287       99.902
SET      28.799       99.907
SET      29.055       99.912
SET      29.823       99.917
SET      30.207       99.922
SET      30.463       99.927
SET      30.975       99.932
SET      31.615       99.937
SET      32.127       99.941
SET      33.279       99.946
SET      34.047       99.951
SET      34.303       99.954
SET      34.559       99.956
SET      35.327       99.958
SET      35.839       99.961
SET      36.351       99.963
SET      37.631       99.966
SET      38.143       99.968
SET      38.655       99.971
SET      39.679       99.973
SET      40.191       99.976
SET      40.447       99.977
SET      40.703       99.978
SET      41.471       99.979
SET      41.727       99.980
SET      42.239       99.982
SET      42.495       99.983
SET      43.007       99.984
SET      43.263       99.985
SET      43.519       99.987
SET      44.031       99.988
SET      44.031       99.988
SET      44.031       99.989
SET      44.543       99.990
SET      45.055       99.990
SET      45.311       99.991
SET      45.567       99.991
SET      46.079       99.992
SET      46.847       99.993
SET      46.847       99.993
SET      47.103       99.994
SET      47.103       99.994
SET      47.103       99.995
SET      47.615       99.995
SET      48.127       99.995
SET      49.407       99.995
SET      49.663       99.996
SET      49.663       99.996
SET      49.919       99.996
SET      49.919       99.997
SET      51.967       99.997
SET      51.967       99.997
SET      51.967       99.997
SET      52.735       99.997
SET      52.735       99.998
SET      52.991       99.998
SET      52.991       99.998
SET      52.991       99.998
[...]
SET      53.503       99.998
SET      53.503       99.998
SET      53.503       99.999
SET      53.503       99.999
SET      55.039       99.999
SET      55.039      100.000
---
GET       0.055        0.000
GET       0.391        5.000
GET       0.639       10.000
GET       0.943       15.000
GET       1.287       20.000
GET       1.615       25.000
GET       1.911       30.000
GET       2.175       35.000
GET       2.383       40.000
GET       2.575       45.000
GET       2.735       50.000
GET       2.815       52.500
GET       2.879       55.000
GET       2.943       57.500
GET       2.991       60.000
GET       3.039       62.500
GET       3.087       65.000
GET       3.135       67.500
GET       3.183       70.000
GET       3.215       72.500
GET       3.279       75.000
GET       3.311       76.250
GET       3.343       77.500
GET       3.375       78.750
GET       3.423       80.000
GET       3.471       81.250
GET       3.519       82.500
GET       3.583       83.750
GET       3.631       85.000
GET       3.679       86.250
GET       3.743       87.500
GET       3.759       88.125
GET       3.791       88.750
GET       3.823       89.375
GET       3.855       90.000
GET       3.887       90.625
GET       3.935       91.250
GET       3.983       91.875
GET       4.031       92.500
GET       4.095       93.125
GET       4.159       93.750
GET       4.223       94.062
GET       4.255       94.375
GET       4.319       94.688
GET       4.351       95.000
GET       4.415       95.312
GET       4.479       95.625
GET       4.543       95.938
GET       4.639       96.250
GET       4.735       96.562
GET       4.863       96.875
GET       4.927       97.031
GET       5.023       97.188
GET       5.119       97.344
GET       5.215       97.500
GET       5.343       97.656
GET       5.471       97.812
GET       5.599       97.969
GET       5.759       98.125
GET       5.919       98.281
GET       6.079       98.438
GET       6.175       98.516
GET       6.303       98.594
GET       6.431       98.672
GET       6.527       98.750
GET       6.655       98.828
GET       6.783       98.906
GET       6.911       98.984
GET       7.071       99.062
GET       7.263       99.141
GET       7.455       99.219
GET       7.551       99.258
GET       7.679       99.297
GET       7.807       99.336
GET       7.967       99.375
GET       8.095       99.414
GET       8.255       99.453
GET       8.511       99.492
GET       8.703       99.531
GET       9.023       99.570
GET       9.343       99.609
GET       9.599       99.629
GET       9.855       99.648
GET      10.111       99.668
GET      10.495       99.688
GET      10.751       99.707
GET      11.263       99.727
GET      11.967       99.746
GET      12.415       99.766
GET      13.631       99.785
GET      15.615       99.805
GET      16.639       99.814
GET      17.663       99.824
GET      19.967       99.834
GET      21.887       99.844
GET      23.295       99.854
GET      24.959       99.863
GET      25.855       99.873
GET      26.751       99.883
GET      27.519       99.893
GET      28.159       99.902
GET      28.799       99.907
GET      29.055       99.912
GET      29.951       99.917
GET      30.207       99.922
GET      30.591       99.927
GET      30.975       99.932
GET      31.743       99.937
GET      32.255       99.941
GET      33.279       99.946
GET      34.047       99.951
GET      34.303       99.954
GET      34.559       99.956
GET      35.071       99.958
GET      35.839       99.961
GET      36.095       99.963
GET      37.119       99.966
GET      37.631       99.968
GET      38.399       99.971
GET      39.679       99.973
GET      39.935       99.976
GET      40.191       99.977
GET      40.703       99.978
GET      41.215       99.979
GET      41.471       99.980
GET      41.727       99.982
GET      42.495       99.983
GET      42.751       99.984
GET      43.007       99.985
GET      43.519       99.987
GET      43.775       99.988
GET      44.031       99.988
GET      44.031       99.989
GET      44.543       99.990
GET      44.799       99.990
GET      45.311       99.991
GET      45.311       99.991
GET      45.823       99.992
GET      46.847       99.993
GET      46.847       99.993
GET      47.103       99.994
GET      47.103       99.994
GET      47.103       99.995
GET      47.103       99.995
GET      47.615       99.995
GET      49.407       99.995
GET      49.663       99.996
GET      49.663       99.996
GET      49.919       99.996
GET      49.919       99.997
GET      49.919       99.997
GET      50.431       99.997
GET      51.967       99.997
GET      52.479       99.997
GET      52.735       99.998
GET      52.735       99.998
GET      52.735       99.998
[...]
GET      52.991       99.998
GET      52.991       99.998
GET      52.991       99.998
GET      52.991       99.999
GET      52.991       99.999
GET      53.503       99.999
GET      53.503       99.999
GET      53.759       99.999
GET      53.759       99.999
GET      55.039       99.999
GET      55.039      100.000
---
WAIT      0.000      100.000